## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.externaldns[0].kubernetes_deployment.externaldns is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "externaldns" {
      ~ id               = "externaldns/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ resource_version = "3956861" -> (known after apply)
          ~ uid              = "c82d9fa7-b49d-413d-a2ed-b08c3e54a710" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                    # (13 unchanged attributes hidden)

                  ~ container {
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "external-dns"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  ~ security_context {
                      - supplemental_groups    = [] -> null
                        # (5 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/GITHUB_PAT"] will be created
  + resource "vault_kv_secret_v2" "initial_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "kv"
      + name                = "cluster-secret-store/secrets/GITHUB_PAT"
      + path                = (known after apply)

      + custom_metadata (known after apply)
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/github_token"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/github_token"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/github_token" -> null
      - metadata            = {
          - "created_time"    = "2025-04-19T19:05:35.463665316Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "2"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/github_token" -> null
      - path                = "kv/data/cluster-secret-store/secrets/github_token" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITLAB_TOKEN" -> "GITHUB_PAT"
                              ~ property = "data.GITLAB_TOKEN" -> "data.GITHUB_PAT"
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "GITHUB_PAT"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "HARBOR_KEY" -> "GITLAB_TOKEN"
                              ~ property = "data.HARBOR_KEY" -> "data.GITLAB_TOKEN"
                            }
                          ~ secretKey = "HARBOR_KEY" -> "GITLAB_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "ISTIO_PRIMARY_CA" -> "HARBOR_KEY"
                              ~ property = "data.ISTIO_PRIMARY_CA" -> "data.HARBOR_KEY"
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "HARBOR_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "KUBECONFIG" -> "ISTIO_PRIMARY_CA"
                              ~ property = "data.KUBECONFIG" -> "data.ISTIO_PRIMARY_CA"
                            }
                          ~ secretKey = "KUBECONFIG" -> "ISTIO_PRIMARY_CA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "MINIO" -> "KUBECONFIG"
                              ~ property = "data.rootPassword" -> "data.KUBECONFIG"
                            }
                          ~ secretKey = "rootPassword" -> "KUBECONFIG"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.rootUser" -> "data.rootPassword"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "rootUser" -> "rootPassword"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "POSTGRES" -> "MINIO"
                              ~ property = "data.DATA" -> "data.rootUser"
                            }
                          ~ secretKey = "DATA" -> "rootUser"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_DATABASE" -> "data.DATA"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "DATA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_HOST" -> "data.POSTGRES_DATABASE"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_DATABASE"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_HOST"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_HOST"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PORT" -> "data.POSTGRES_PASSWORD"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_USER" -> "data.POSTGRES_PORT"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_USER" -> "POSTGRES_PORT"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "REDIS" -> "POSTGRES"
                              ~ property = "data.REDIS_PASSWORD" -> "data.POSTGRES_USER"
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "POSTGRES_USER"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SOPS" -> "REDIS"
                              ~ property = "data.SOPS" -> "data.REDIS_PASSWORD"
                            }
                          ~ secretKey = "SOPS" -> "REDIS_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SSH_PRIVATE_KEY" -> "SOPS"
                              ~ property = "data.SSH_PRIVATE_KEY" -> "data.SOPS"
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "SOPS"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_PROXMOX_PASSWORD" -> "SSH_PRIVATE_KEY"
                              ~ property = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.SSH_PRIVATE_KEY"
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "SSH_PRIVATE_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_VAULT_TOKEN" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property = "data.TF_VAR_VAULT_TOKEN" -> "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "TF_VAR_PROXMOX_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "VAULT_TOKEN" -> "TF_VAR_VAULT_TOKEN"
                              ~ property = "data.VAULT_TOKEN" -> "data.TF_VAR_VAULT_TOKEN"
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "TF_VAR_VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "github_token" -> "VAULT_TOKEN"
                              ~ property = "data.github_token" -> "data.VAULT_TOKEN"
                            }
                          ~ secretKey = "github_token" -> "VAULT_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                                version            = null
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITLAB_TOKEN" -> "GITHUB_PAT"
                              ~ property           = "data.GITLAB_TOKEN" -> "data.GITHUB_PAT"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "GITHUB_PAT"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "HARBOR_KEY" -> "GITLAB_TOKEN"
                              ~ property           = "data.HARBOR_KEY" -> "data.GITLAB_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "HARBOR_KEY" -> "GITLAB_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "ISTIO_PRIMARY_CA" -> "HARBOR_KEY"
                              ~ property           = "data.ISTIO_PRIMARY_CA" -> "data.HARBOR_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "HARBOR_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "KUBECONFIG" -> "ISTIO_PRIMARY_CA"
                              ~ property           = "data.KUBECONFIG" -> "data.ISTIO_PRIMARY_CA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "KUBECONFIG" -> "ISTIO_PRIMARY_CA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "MINIO" -> "KUBECONFIG"
                              ~ property           = "data.rootPassword" -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootPassword" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.rootUser" -> "data.rootPassword"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootUser" -> "rootPassword"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "POSTGRES" -> "MINIO"
                              ~ property           = "data.DATA" -> "data.rootUser"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "DATA" -> "rootUser"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_DATABASE" -> "data.DATA"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "DATA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_HOST" -> "data.POSTGRES_DATABASE"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_DATABASE"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_HOST"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_HOST"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PORT" -> "data.POSTGRES_PASSWORD"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_USER" -> "data.POSTGRES_PORT"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_USER" -> "POSTGRES_PORT"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "REDIS" -> "POSTGRES"
                              ~ property           = "data.REDIS_PASSWORD" -> "data.POSTGRES_USER"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "POSTGRES_USER"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SOPS" -> "REDIS"
                              ~ property           = "data.SOPS" -> "data.REDIS_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "SOPS" -> "REDIS_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SSH_PRIVATE_KEY" -> "SOPS"
                              ~ property           = "data.SSH_PRIVATE_KEY" -> "data.SOPS"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "SOPS"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "TF_VAR_PROXMOX_PASSWORD" -> "SSH_PRIVATE_KEY"
                              ~ property           = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.SSH_PRIVATE_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "SSH_PRIVATE_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "TF_VAR_VAULT_TOKEN" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property           = "data.TF_VAR_VAULT_TOKEN" -> "data.TF_VAR_PROXMOX_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "TF_VAR_PROXMOX_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "VAULT_TOKEN" -> "TF_VAR_VAULT_TOKEN"
                              ~ property           = "data.VAULT_TOKEN" -> "data.TF_VAR_VAULT_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "TF_VAR_VAULT_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "github_token" -> "VAULT_TOKEN"
                              ~ property           = "data.github_token" -> "data.VAULT_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "github_token" -> "VAULT_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  